In [1]:
student_1 <- data.frame('name'=c('Hellen','Jolie','Kiwi','John','Mark','Tom'),
                       'age'=c(17,16,17,18,19,16),
                       'mark'=c(9,9,8,7.5,7.5,6),
                       stringsAsFactors=TRUE)

In [2]:
print(student_1)

    name age mark
1 Hellen  17  9.0
2  Jolie  16  9.0
3   Kiwi  17  8.0
4   John  18  7.5
5   Mark  19  7.5
6    Tom  16  6.0

In [3]:
str(student_1)

'data.frame':	6 obs. of  3 variables:
 $ name: Factor w/ 6 levels "Hellen","John",..: 1 3 4 2 5 6
 $ age : num  17 16 17 18 19 16
 $ mark: num  9 9 8 7.5 7.5 6

In [4]:
print(summary(student_1))

     name        age             mark
 Hellen:1   Min.   :16.00   Min.   :6.000
 John  :1   1st Qu.:16.25   1st Qu.:7.500
 Jolie :1   Median :17.00   Median :7.750
 Kiwi  :1   Mean   :17.17   Mean   :7.833
 Mark  :1   3rd Qu.:17.75   3rd Qu.:8.750
 Tom   :1   Max.   :19.00   Max.   :9.000

In [5]:
print(student_1$mark)

[1] 9.0 9.0 8.0 7.5 7.5 6.0

In [6]:
print(data.frame(student_1$age))

  student_1.age
1            17
2            16
3            17
4            18
5            19
6            16

In [7]:
print(student_1[1:2,])

    name age mark
1 Hellen  17    9
2  Jolie  16    9

In [8]:
print(student_1[c(3,5),c(1,2)])

  name age
3 Kiwi  17
5 Mark  19

In [10]:
student_1$class <- c('k256_S7N','k256_C7N','k256_S24','k256_S7N','k256_S24','k256_C7N')

In [12]:
print(student_1)

    name age mark    class
1 Hellen  17  9.0 k256_S7N
2  Jolie  16  9.0 k256_C7N
3   Kiwi  17  8.0 k256_S24
4   John  18  7.5 k256_S7N
5   Mark  19  7.5 k256_S24
6    Tom  16  6.0 k256_C7N

In [13]:
head(student_1)

  name   age mark class
1 Hellen 17  9.0  k256_S7N
2 Jolie  16  9.0  k256_C7N
3 Kiwi   17  8.0  k256_S24
4 John   18  7.5  k256_S7N
5 Mark   19  7.5  k256_S24
6 Tom    16  6.0  k256_C7N

In [14]:
df_POB <- data.frame('POB' = c('UK','US','EU','UK','US','EU'))
student_1 <- cbind(student_1, df_POB)

In [15]:
print(student_1)

    name age mark    class POB
1 Hellen  17  9.0 k256_S7N  UK
2  Jolie  16  9.0 k256_C7N  US
3   Kiwi  17  8.0 k256_S24  EU
4   John  18  7.5 k256_S7N  UK
5   Mark  19  7.5 k256_S24  US
6    Tom  16  6.0 k256_C7N  EU

In [16]:
new_student <- data.frame('name'=c('Sunny','Lucky'),
                         'age'=c(17,18),
                         'mark'=c(8,9),
                         'class'=c('k256_C7N','k256_S24'),
                         'POB'=c('EU','UK'),
                         stringsAsFactors=FALSE)

In [18]:
student <- rbind(student_1,new_student)

In [19]:
print(student)

    name age mark    class POB
1 Hellen  17  9.0 k256_S7N  UK
2  Jolie  16  9.0 k256_C7N  US
3   Kiwi  17  8.0 k256_S24  EU
4   John  18  7.5 k256_S7N  UK
5   Mark  19  7.5 k256_S24  US
6    Tom  16  6.0 k256_C7N  EU
7  Sunny  17  8.0 k256_C7N  EU
8  Lucky  18  9.0 k256_S24  UK

In [21]:
names(student)[names(student)=='POB'] <- 'Place_of_birth'

In [22]:
head(student)

  name   age mark class    Place_of_birth
1 Hellen 17  9.0  k256_S7N UK
2 Jolie  16  9.0  k256_C7N US
3 Kiwi   17  8.0  k256_S24 EU
4 John   18  7.5  k256_S7N UK
5 Mark   19  7.5  k256_S24 US
6 Tom    16  6.0  k256_C7N EU

# Tidyverse

In [24]:
pokemon <- read.csv('pokemon.csv')

In [26]:
head(pokemon)

  X. Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1 1  Bulbasaur             Grass  Poison 318   45  49     49      65
2 2  Ivysaur               Grass  Poison 405   60  62     63      80
3 3  Venusaur              Grass  Poison 525   80  82     83     100
4 3  VenusaurMega Venusaur Grass  Poison 625   80 100    123     122
5 4  Charmander            Fire          309   39  52     43      60
6 5  Charmeleon            Fire          405   58  64     58      80
  Sp..Def Speed Generation Legendary
1  65     45    1          False
2  80     60    1          False
3 100     80    1          False
4 120     80    1          False
5  50     65    1          False
6  65     80    1          False

In [27]:
str(pokemon)

'data.frame':	800 obs. of  13 variables:
 $ X.        : int  1 2 3 3 4 5 6 6 6 7 ...
 $ Name      : chr  "Bulbasaur" "Ivysaur" "Venusaur" "VenusaurMega Venusaur" ...
 $ Type.1    : chr  "Grass" "Grass" "Grass" "Grass" ...
 $ Type.2    : chr  "Poison" "Poison" "Poison" "Poison" ...
 $ Total     : int  318 405 525 625 309 405 534 634 634 314 ...
 $ HP        : int  45 60 80 80 39 58 78 78 78 44 ...
 $ Attack    : int  49 62 82 100 52 64 84 130 104 48 ...
 $ Defense   : int  49 63 83 123 43 58 78 111 78 65 ...
 $ Sp..Atk   : int  65 80 100 122 60 80 109 130 159 50 ...
 $ Sp..Def   : int  65 80 100 120 50 65 85 85 115 64 ...
 $ Speed     : int  45 60 80 80 65 80 100 100 100 43 ...
 $ Generation: int  1 1 1 1 1 1 1 1 1 1 ...
 $ Legendary : chr  "False" "False" "False" "False" ...

In [28]:
summary(pokemon)

       X.            Name              Type.1             Type.2
 Min.   :  1.0   Length:800         Length:800         Length:800
 1st Qu.:184.8   Class :character   Class :character   Class :character
 Median :364.5   Mode  :character   Mode  :character   Mode  :character
 Mean   :362.8
 3rd Qu.:539.2
 Max.   :721.0
     Total             HP             Attack       Defense
 Min.   :180.0   Min.   :  1.00   Min.   :  5   Min.   :  5.00
 1st Qu.:330.0   1st Qu.: 50.00   1st Qu.: 55   1st Qu.: 50.00
 Median :450.0   Median : 65.00   Median : 75   Median : 70.00
 Mean   :435.1   Mean   : 69.26   Mean   : 79   Mean   : 73.84
 3rd Qu.:515.0   3rd Qu.: 80.00   3rd Qu.:100   3rd Qu.: 90.00
 Max.   :780.0   Max.   :255.00   Max.   :190   Max.   :230.00
    Sp..Atk          Sp..Def          Speed          Generation
 Min.   : 10.00   Min.   : 20.0   Min.   :  5.00   Min.   :1.000
 1st Qu.: 49.75   1st Qu.: 50.0   1st Qu.: 45.00   1st Qu.:2.000
 Median : 65.00   Median : 70.0   Median : 65.00   Median :3.000
 Mean   : 72.82   Mean   : 71.9   Mean   : 68.28   Mean   :3.324
 3rd Qu.: 95.00   3rd Qu.: 90.0   3rd Qu.: 90.00   3rd Qu.:5.000
 Max.   :194.00   Max.   :230.0   Max.   :180.00   Max.   :6.000
  Legendary
 Length:800
 Class :character
 Mode  :character

In [30]:
library('tidyverse')

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

v ggplot2 3.3.2     v purrr   0.3.4
v tibble  3.0.3     v dplyr   1.0.2
v tidyr   1.1.1     v stringr 1.4.0
v readr   1.3.1     v forcats 0.5.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [31]:
pokemon_sub <- select(pokemon,c(2,5,7,8))

In [32]:
head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [35]:
pokemon_sub <- pokemon %>% select(Name,Total,Attack,Defense)

In [36]:
head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [38]:
pokemon_numbers <- select_if(pokemon, is.numeric)

In [39]:
head(pokemon_numbers)

  X. Total HP Attack Defense Sp..Atk Sp..Def Speed Generation
1 1  318   45  49     49      65      65     45    1
2 2  405   60  62     63      80      80     60    1
3 3  525   80  82     83     100     100     80    1
4 3  625   80 100    123     122     120     80    1
5 4  309   39  52     43      60      50     65    1
6 5  405   58  64     58      80      65     80    1

In [40]:
pokemon_500_600 <- filter(pokemon_sub,Total>=500,Total<=600)
head(pokemon_500_600)

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

In [41]:
pokemon_500_600 <- filter(pokemon_sub,Total>=500 & Total<=600)
head(pokemon_500_600)

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

In [42]:
nrow(pokemon_500_600)

[1] 199

In [43]:
str(pokemon_500_600)

'data.frame':	199 obs. of  4 variables:
 $ Name   : chr  "Venusaur" "Charizard" "Blastoise" "PidgeotMega Pidgeot" ...
 $ Total  : int  525 534 530 579 505 505 505 500 555 510 ...
 $ Attack : int  82 84 83 80 92 102 76 82 110 95 ...
 $ Defense: int  83 78 100 80 87 77 75 78 80 95 ...

In [44]:
pokemon_sub <- mutate(pokemon_sub, Compare = ifelse(Attack>Defense,1,0))

In [45]:
head(pokemon_sub)

  Name                  Total Attack Defense Compare
1 Bulbasaur             318    49     49     0
2 Ivysaur               405    62     63     0
3 Venusaur              525    82     83     0
4 VenusaurMega Venusaur 625   100    123     0
5 Charmander            309    52     43     1
6 Charmeleon            405    64     58     1

In [46]:
head(arrange(pokemon_sub,Total))

  Name      Total Attack Defense Compare
1 Sunkern   180   30     30      0
2 Azurill   190   20     40      0
3 Kricketot 194   25     41      0
4 Caterpie  195   30     35      0
5 Weedle    195   35     30      1
6 Wurmple   195   45     35      1

In [47]:
head(arrange(pokemon_sub,desc(Total)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 MewtwoMega Mewtwo Y   780   150     70     1
3 RayquazaMega Rayquaza 780   180    100     1
4 KyogrePrimal Kyogre   770   150     90     1
5 GroudonPrimal Groudon 770   180    160     1
6 Arceus                720   120    120     0

In [48]:
head(arrange(pokemon_sub, desc(Total), desc(Attack)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 RayquazaMega Rayquaza 780   180    100     1
3 MewtwoMega Mewtwo Y   780   150     70     1
4 GroudonPrimal Groudon 770   180    160     1
5 KyogrePrimal Kyogre   770   150     90     1
6 Arceus                720   120    120     0

In [49]:
group <- group_by(pokemon, Type.1)
summary <- summarize(group,
                    count = n(),
                    mean.Attack = mean(Attack, na.rm=T),
                    median.Attack = median(Attack, na.rm=T),
                    mean.Defense = mean(Defense, na.rm=T),
                    median.Defense = median(Defense, na.rm=T))

`summarise()` ungrouping output (override with `.groups` argument)

In [50]:
summary

   Type.1   count mean.Attack median.Attack mean.Defense median.Defense
1  Bug       69    70.97101    65.0          70.72464     60.0
2  Dark      31    88.38710    88.0          70.22581     70.0
3  Dragon    32   112.12500   113.5          86.37500     90.0
4  Electric  44    69.09091    65.0          66.29545     65.0
5  Fairy     17    61.52941    52.0          65.70588     66.0
6  Fighting  27    96.77778   100.0          65.92593     70.0
7  Fire      52    84.76923    84.5          67.76923     64.0
8  Flying     4    78.75000    85.0          66.25000     75.0
9  Ghost     32    73.78125    66.0          81.18750     72.5
10 Grass     70    73.21429    70.0          70.80000     66.0
11 Ground    32    95.75000    85.0          84.84375     84.5
12 Ice       24    72.75000    67.0          71.41667     75.0
13 Normal    98    73.46939    70.5          59.84694     60.0
14 Poison    28    74.67857    74.0          68.82143     67.0
15 Psychic   57    71.45614    57.0          67.68421     65.0
16 Rock      44    92.86364    95.0         100.79545    100.0
17 Steel     27    92.70370    89.0         126.37037    120.0
18 Water    112    74.15179    72.0          72.94643     70.0

In [60]:
df_new <- count(pokemon, Type.1)

In [64]:
df_new <- mutate(df_new, Percentage = 100*round(n/sum(df_new$n),4))

In [66]:
df_new %>% sample_n(6)

  Type.1   n  Percentage
1 Fighting 27 3.38
2 Electric 44 5.50
3 Ghost    32 4.00
4 Psychic  57 7.12
5 Ground   32 4.00
6 Bug      69 8.62

In [68]:
df_new %>% sample_frac(0.5)

  Type.1   n   Percentage
1 Psychic   57  7.12
2 Normal    98 12.25
3 Fighting  27  3.38
4 Fairy     17  2.13
5 Flying     4  0.50
6 Dragon    32  4.00
7 Bug       69  8.62
8 Water    112 14.00
9 Dark      31  3.88

In [69]:
max(df_new$Percentage)

[1] 14

In [79]:
# df_new[df_new$Percentage == max(df_new$Percentage)]
df_new[df_new['Percentage'] == max(df_new$Percentage)]

[1] "Water" "112"   "14.00"